//
//  50 sound.swift
//  50 sound
//
//  Created by 陳韋綸 on 2022/3/19.
//

import Foundation

class Tone {
    
    static let shared = Tone()
    
    func hiraganaTone() -> [String] {
        let tone = [
            "あ","い","う","え","お",
            "か","き","く","け","こ",
            "さ","し","す","せ","そ",
            "た","ち","つ","て","と",
            "な","に","ぬ","ね","の",
            "は","ひ","ふ","へ","ほ",
            "ま","み","む","め","も",
            "ら","り","る","れ","ろ",
            "や","ゆ","よ","わ","を"
        ]
        return tone
    }
    
    func katakanaTone() -> [String] {
        let tone = [
            "ア","イ","ウ","エ","オ",
            "カ","キ","ク","ケ","コ",
            "サ","シ","ス","セ","ソ",
            "タ","チ","ツ","テ","ト",
            "ナ","ニ","ヌ","ネ","ノ",
            "ハ","ヒ","フ","ヘ","ホ",
            "マ","ミ","ム","メ","モ",
            "ラ","リ","ル","レ","ロ",
            "ヤ","ユ","ヨ","ワ","ヲ"
        ]
        return tone
    }
}
